[
  {
    "title": "Mitt første program",
    "description": "På denne siden så kan du kode i et programmeringsspråk som heter Python. Til høyre ser du to hvite bokser. Den øverste er editoren din, mens boksen under er outputfeltet. Outputfeltet er boksen som skriver ut resultatet av koden i editoren når du trykker på kjøreknappen. I eksempelet til høyre ser du et funksjonskall på print som skriver ut strengen 'Hei verden!' til outputfeltet. Prøv deg frem ved å trykke på kjøreknappen.",
    "initialCode": "print('Hei verden!')",
    "solution": {
      "solved": "",
      "code": ""
    }
  },
  {
    "title": "Koding",
    "description": "Kode er det samme som en oppskrift som maskinene våre følger bastant. Det betyr at maskinen din skriver ut nøyaktig hva som er mellom ' tegnene i funksjonskallet for print. Erstatt progg.it med ditt eget navn så vil du får en hilsen fra din egen maskin.",
    "initialCode": "print('Hei mitt navn er progg.it')",
    "solution": {
      "solved": "",
      "code": ""
    }
  },
  {
    "title": "Variabler av tall",
    "description": "I matematikken lærer vi om ligninger med ukjente variabler der vår oppgave som oftest er å finne ut hva variabelen er lik. Dette fungerer litt annerledes i programmering hvor vi er sjefen. Vi bestemmer hva variabelen skal være lik. I editoren så ser du en variabel x som vi har satt lik 3. Prøv å bytt ut 3 med ditt favorittall og trykk på kjør. Funksjonen print kan ta hvilke som helst variabler og printer fortsatt ut som om vi hadde byttet ut variabelen med verdien.",
    "initialCode": "x = 3\nprint(x)",
    "solution": {
      "solved": "",
      "code": ""
    }
  },
  {
    "title": "Variabler av strenger",
    "description": "Variabler kan ikke bare være tall, men tekststrenger også. Variabler kan også hete nesten hva som helst så lenge variabelnavnet begynner med en bokstav. Trykk på kjør og se resultatet.",
    "initialCode": "var1 = 'Jeg heter var1 og er en variabel'\nprint(var1)",
    "solution": {
      "solved": "",
      "code": ""
    }
  },
  {
    "title": "Uttrykk",
    "description": "Til høyre ser du et eksempel med to variabler x og y med en linje for å printe summen av disse variablene. Prøv deg frem med å trykke på kjøreknappen!",
    "initialCode": "x = 50\ny = 30\nprint(x + y)",
    "solution": {
      "solved": "",
      "code": ""
    }
  },
  {
    "title": "Kvadratroten",
    "description": "Python er et utrolig sterkt språk med masse biblioteker som gjør koding mye enklere for oss. Før vi bruker et bibliotek så må vi importere biblioteket som du ser i linje 1 i editoren. Et bibliotek, math, er en bibliotek med masse matematiske funksjoner. I editoren så ser du bruken av math sin funksjon for å regne ut kvadratroten av et tall eller variabel som er mellom parantesene. Skriv et program som skriver ut kvadratroten av 36.",
    "initialCode": "import math\nx = 16\nsqrtX = math.sqrt(x)\nprint(sqrtX)",
    "solution": {
      "solved": 6.0,
      "code": "import math\nx = 36\nsqrtX = math.sqrt(x)\nprint('Kvadratroten til 36 er lik')\nprint(sqrtX)"
    }
  },
  {
    "title": "Pytagoras",
    "description": "Pytagoras sin læresetning handler om at summen av arealene til katetene i en rettvinklet trekant er lik arealet til hypotenusen. Skriv et program som regner og skriver ut hypotenusen til en trekant der katetene er lik 5 og 12.",
    "initialCode": "",
    "solution": {
      "solved": 13,
      "code": "import math\nkat1 = 5\nkat2 = 12\nhyp = math.sqrt(kat1*kat1+kat2*kat2)\nprint('Hypotenusen til en rettvinklet trekant med kateter 5 og 12 er lik')\nprint(hyp)"
    }
  },
  {
    "title": "Lister",
    "description": "",
    "initialCode": "liste = [67,31,53,6,97,1]\nprint(liste)",
    "solution": {
      "solved": 0,
      "code": ""
    }
  },
  {
    "title": "Elementer i lister",
    "description": "",
    "initialCode": "liste = [67,31,53,6,97,1]\nprint(liste[4])",
    "solution": {
      "solved": 0,
      "code": ""
    }
  },
  {
    "title": "Funksjonen range",
    "description": "",
    "initialCode": "liste = range(0,10)\nprint(liste)",
    "solution": {
      "solved": 0,
      "code": ""
    }
  },
  {
    "title": "Løkker",
    "description": "Datamaskinen er utrolig flink til å gjøre en ting mange ganger og gi oss kjappe resultater. Tenk deg om vi fikk i oppgave om å telle til 100. Det tar litt tid for oss mennesker å ramse opp alle tallene. Ordet 'for' er et nøkkelord i som sier til damaskinen at vi har et stykke kode som vi vil kjøre mange ganger. I editoren, ser du et eksempel på hvordan en løkke er skrevet i Python hvor print funksjonen blir kalt 50 ganger og printer ut alle tallene fra 25 til 50. Endre på løkken slik at print skriver ut alle tall fra 0 til 100.",
    "initialCode": "for i in range(25,50):\n\tprint(i)",
    "solution": {
      "solved": 0,
      "code": ""
    }
  }
]
